---
kind: property
id: P:Autodesk.Revit.UI.Events.DialogBoxData.HelpId
source: html/78ecd40f-36fc-662f-dac8-afc684869f26.htm
---
# Autodesk.Revit.UI.Events.DialogBoxData.HelpId Property

An ID that represents the dialog that has been displayed.

## Syntax (C#)
```csharp
public int HelpId { get; }
```

## Remarks
Use this ID within your application to key suitable responses for the dialog. Note: this id is
not guaranteed to remain stable for different builds of Autodesk Revit.